app/views/repos/index.html.erb

SELECT COUNT(*) FROM "logs"
---
        <td><%= link_to "Logs", log_path %></td>
        <td><%= Log.all.count.to_s %></td>