app/controllers/logs_controller.rb

SELECT "logs".* FROM "logs" ORDER BY "logs"."created_at" DESC
---
  def index
    @logs = Log.all.order(created_at: :desc)