app/controllers/repos_controller.rb

SELECT "repositories"."vat" FROM "repositories"
SELECT "responses"."vat" FROM "responses" WHERE ("responses"."vat" NOT IN ('hvg5C'))
SELECT COUNT(*) FROM "repositories"
SELECT COUNT(*) FROM "responses" WHERE "responses"."vat" IN ('on-time', '<en>Did you arrive at work on time today?</en><de>Heute rechtzeitig in der Arbeit angekommen?</de>')
---
  def index
    @available = Repository.all.pluck(:vat)
    @unknowns = Response.where.not(vat: Repository.pluck(:vat)).pluck(:vat).uniq
    @repos = (@available + @unknowns).paginate(page: params[:page], per_page: 15)

SELECT "repositories".* FROM "repositories" WHERE "repositories"."vat" = 'hvg5C' LIMIT 1
SELECT "responses".* FROM "responses" WHERE "responses"."vat" = 'hvg5C' ORDER BY "responses"."id" ASC LIMIT 1
INSERT INTO "repositories" ("created_at", "updated_at", "vat") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Fri, 03 Apr 2015 22:29:37 UTC +00:00], ["updated_at", Fri, 03 Apr 2015 22:29:37 UTC +00:00], ["vat", "hvg5C"]]
---
  def show
    @repo = Repository.find_by_vat(params[:id])
    @responses = Response.where(vat: params[:id])
    if @repo.nil?
      server = @responses.first.list.to_s
      if server == "" then
        server = "https://www.crwdst.at"
      end
      lookup = HTTParty.get(server + "/" + params[:id] + "/quest_json")
      if lookup.success?
        @repo = Repository.create(name: lookup[0]['name'],
                                  vat:  params[:id])

DELETE FROM "responses" WHERE "responses"."id" = $1  [["id", 2]]
SELECT "responses".* FROM "responses" WHERE "responses"."vat" = 'asdf'
---
  def destroy
    Response.where(vat: params[:id]).destroy_all